<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="?,?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Concat_375" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="0" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="7,input.1">
					<dim>-1</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.fc1.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="128, 784" offset="16" size="200704" />
			<output>
				<port id="0" precision="FP16" names="self.fc1.weight">
					<dim>128</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="self.fc1.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>128</dim>
					<dim>784</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="__module.fc1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>784</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>128</dim>
					<dim>784</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_1973_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 128" offset="200720" size="256" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_1973" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="__module.fc1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="16,input.3">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="aten::relu/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="9,input.5">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="self.fc2.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="10, 128" offset="200976" size="2560" />
			<output>
				<port id="0" precision="FP16" names="self.fc2.weight">
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="self.fc2.weight" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.fc2/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>128</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>10</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_1974_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 10" offset="203536" size="20" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Constant_1974" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.fc2/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="19,input">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="aten::log_softmax/LogSoftmax" type="LogSoftmax" version="opset5">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Result_29" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>10</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="0" />
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1" />
		<edge from-layer="5" from-port="2" to-layer="8" to-port="0" />
		<edge from-layer="6" from-port="0" to-layer="7" to-port="0" />
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1" />
		<edge from-layer="8" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="9" from-port="1" to-layer="12" to-port="0" />
		<edge from-layer="10" from-port="0" to-layer="11" to-port="0" />
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1" />
		<edge from-layer="12" from-port="2" to-layer="15" to-port="0" />
		<edge from-layer="13" from-port="0" to-layer="14" to-port="0" />
		<edge from-layer="14" from-port="1" to-layer="15" to-port="1" />
		<edge from-layer="15" from-port="2" to-layer="16" to-port="0" />
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2025.3.0-19807-44526285f24-releases/2025/3" />
		<conversion_parameters>
			<framework value="pytorch" />
			<is_python_object value="True" />
		</conversion_parameters>
	</rt_info>
</net>
